# taps
tap "homebrew/cask-fonts"
#tap "koekeishiya/formulae"
tap "d12frosted/emacs-plus"

# important
brew "asciinema"
brew "ack"
brew "ag"
brew "aspell"
brew "bash"
brew "bat"
brew "eth-p/software/bat-extras"
brew "certbot"
brew "colordiff"
brew "coreutils"
brew "emacs-plus@28", args: ["with-native-comp", "with-modern-doom3-icon"]
#brew "emacs-plus@27", args: ["without-spacemacs-icon", "with-jansson", "with-modern-doom3-icon", "HEAD"]
brew "fd"
brew "ffmpeg"
brew "git"
brew "git-lfs"
brew "gnu-getopt"
brew "gnu-sed"
brew "gnu-tar"
brew "gopass"
brew "gnupg"
brew "graphviz"
brew "grep"
brew "jq"
brew "ncdu"
brew "nvm"
brew "pandoc"
brew "pinentry-mac"
brew "prettier"
brew "proselint"
brew "pygments"
brew "python@3.8"
brew "python@3.9"
brew "rg"
brew "shellcheck"
#brew "skhd", args: ["with-logging", "HEAD"], restart_service: :changed
brew "terminal-notifier", link: true
brew "tree"
brew "tldr"
brew "wget"
#brew "yabai", restart_service: :changed
#brew "zsh"

# clojure
brew "maven"
brew "clojure"
brew "borkdude/brew/babashka"
brew "borkdude/brew/clj-kondo"
brew "borkdude/brew/jet"
brew "clojure-lsp/brew/clojure-lsp-native"
brew "clojurescript"
brew "openjdk@8"

# applications
#cask "docker"
cask "firefox"
#cask "gopass-ui"
#cask "gpg-suite"
cask "kitty"
cask "platypus"
cask "discord"
cask "telegram"
cask "tor-browser"
cask "vlc"


# other

# fonts
cask "font-source-code-pro"
cask "font-awesome-terminal-fonts"
cask "font-fontawesome"
cask "font-iosevka-nerd-font"
cask "font-inconsolata-nerd-font"
cask "font-hack-nerd-font"
cask "font-roboto-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-material-design-icons-webfont"
cask "font-jetbrains-mono"
