# taps
tap "homebrew/cask-fonts"
#tap "koekeishiya/formulae"
tap "d12frosted/emacs-plus"

# important
brew "asciinema"
brew "ack"
#brew "ag"
brew "aspell"
brew "bash"
brew "bat"
#brew "eth-p/software/bat-extras"
brew "certbot"
brew "colordiff"
brew "coreutils"
brew "emacs-plus@29", args: ["with-native-comp", "with-modern-doom3-icon"]
#brew "emacs-plus@27", args: ["without-spacemacs-icon", "with-jansson", "with-modern-doom3-icon", "HEAD"]
brew "exiftool"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "git"
brew "git-lfs"
brew "gnu-getopt"
brew "gnu-sed"
brew "gnu-tar"
brew "gopass"
brew "gnupg"
brew "gnu-sed"
brew "graphviz"
brew "grep"
brew "guile"
brew "janet"
brew "jenv"
brew "jq"
brew "lua@5.1"
brew "lua@5.4"
brew "luarocks"
brew "ncdu"
brew "nvm"
brew "pandoc"
brew "pinentry-mac"
brew "prettier"
brew "proselint"
brew "pygments"
brew "python@3.10"
brew "python@3.11"
brew "ripgrep"
brew "rlwrap"
brew "shellcheck"
brew "starship"
#brew "skhd", args: ["with-logging", "HEAD"], restart_service: :changed
brew "terminal-notifier", link: true
brew "tree"
brew "tldr"
brew "wget"
#brew "yabai", restart_service: :changed
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-git-prompt"

# clojure
brew "maven"
brew "clojure"
brew "borkdude/brew/babashka"
brew "borkdude/brew/clj-kondo"
brew "borkdude/brew/jet"
brew "clojure-lsp/brew/clojure-lsp-native"
brew "clojurescript"
brew "adoptopenjdk8"

# applications
cask "docker"
cask "firefox"
cask "1password-cli"
#cask "gopass-ui"
#cask "gpg-suite"
cask "google-chrome"
cask "jitsi-meet"
cask "kitty"
cask "love"
#cask "miniforge"
#cask "platypus"
#cask "racket"
cask "discord"
cask "telegram"
cask "tor-browser"
cask "visual-studio-code"
#cask "vlc"
cask "zoom"


# other

# fonts
cask "font-alegreya"
cask "font-awesome-terminal-fonts"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-fontawesome"
cask "font-hack-nerd-font"
cask "font-inconsolata-nerd-font"
cask "font-iosevka-nerd-font"
cask "font-iosevka-curly"
cask "font-iosevka-ss14"
cask "font-iosevka-ss04"
cask "font-iosevka-slab"
cask "font-iosevka-aile"
cask "font-iosevka-etoile"
cask "font-jetbrains-mono"
cask "font-material-design-icons-webfont"
cask "font-roboto-mono-nerd-font"
cask "font-sf-mono"
cask "font-sf-pro"
cask "font-source-code-pro"
cask "font-ubuntu-mono-nerd-font"
