# taps
tap "homebrew/cask-fonts"
#tap "koekeishiya/formulae"
tap "d12frosted/emacs-plus"
tap "scalacenter/bloop"

# important
brew "asciinema"
brew "aspell"
brew "bash"
brew "bat"
brew "eth-p/software/bat-extras"
brew "certbot"
brew "coreutils"
brew "emacs-plus@27", args: ["without-spacemacs-icon", "with-jansson", "with-modern-doom3-icon", "HEAD"]
brew "fd"
brew "ffmpeg"
#brew "fish"
brew "git"
brew "git-lfs"
brew "gnu-getopt"
brew "gnu-sed"
brew "gnu-tar"
brew "gopass"
brew "graphviz"
brew "grep"
brew "jq"
brew "ncdu"
brew "node"
brew "ossp-uuid"
brew "pandoc"
brew "pinentry-mac"
brew "prettier"
brew "proselint"
brew "pygments"
brew "rg"
brew "shellcheck"
#brew "skhd", args: ["with-logging", "HEAD"], restart_service: :changed
brew "terminal-notifier", link: true
brew "tree"
brew "wget"
#brew "yabai", restart_service: :changed
brew "zsh"

# clojure
brew "maven"
brew "clojure"
brew "borkdude/brew/babashka"
brew "borkdude/brew/jet"
brew "clojure-lsp"
brew "clojurescript"

# applications
#cask "alfred"
#cask "bartender"
#cask "cryptomator"
#cask "cyberduck"
#cask "docker"
cask "firefox"
#cask "gopass-ui"
#cask "gpg-suite"
cask "kitty"
#cask "mactex"
cask "platypus"
#cask "slack"
cask "telegram"
cask "tor-browser"
cask "vlc"
#cask "vox"
#cask "vox-preferences-pane"
#cask "xquartz"


# fonts
cask "font-iosevka-nerd-font"
cask "font-source-code-pro"
cask "font-inconsolata-nerd-font"
cask "font-robotomono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-hack-nerd-font"
cask "font-noto-nerd-font"
cask "font-awesome-terminal-fonts"
cask "font-fontawesome"
